#Найпростіший спосіб перетворити будь-яке вказане значення кілометрів у милі в Python — це визначити коефіцієнт перетворення.
#Коефіцієнт перетворення — це змінна, у якій ми зберігаємо число, яке потрібно помножити на задане значення кілометрів, щоб отримати результат у милях.
#Написати програму Python для перетворення кілометрів у милі за формулою: 
#1 км = 0,621371 милі

try:
    kilometers = float(input("Введіть значення в кілометрах: "))
    correlation = 0.621371
    miles = kilometers * correlation
    print(f"{kilometers} кілометрів складає {miles} миль")
except ValueError:
    print("Введіть числове значення для кілометрів.")

