#Дано кількість діб n. Пройшло m хвилин. Скільки годин та хвилин показує електронний годинник у даний момент. 
#Програма має надрукувати два числа: кількість годин (від 0 до 23) та кількість хвилин (від 0 до 59). 

n = input("Введіть кількість діб (n): ")
m = input("Введіть кількість хвилин (m): ")

if n.isdigit() and m.isdigit():
    n = int(n)
    m = int(m)
    total_hours = n * 24 + m // 60
    total_minutes = n * 24 * 60 + m 
    hours = total_hours % 24
    minutes = total_minutes % 60
    print("Час:", hours, "год :", minutes, "хв")
else:
    print ("Невірне значення. Введіть числове значення")