#Площа трикутника - це загальна площа, охоплена межею трикутника. Вона дорівнює половині добутку її основи на висоту. 
#Площа трикутника вимірюється в квадратних одиницях. Якщо основа трикутника дорівнює b, а його висота дорівнює h, то його площа визначається як
#Площа трикутника = 1/2 × b × h

#Напишіть програму, що приймає основу і висоту трикутника, та друкує його площину.

try:
    b = float(input("Введіть довжину основи трикутника: b= "))
    h = float(input("Введіть висоту трикутника: h= "))

    if b > 0 and h > 0:
        area = (b * h) / 2
        print("Площа трикутника за допомогою основи і висоти:", area)
    else:
        print("Довжина основи та висоти повинні бути додатніми числами.")
except ValueError:
    print("Введіть числове значення для довжини основи та висоти.")