#Площа трикутника - це загальна площа, охоплена межею трикутника. Вона дорівнює половині добутку її основи на висоту. 
#Площа трикутника вимірюється в квадратних одиницях. Якщо основа трикутника дорівнює b, а його висота дорівнює h, то його площа визначається як
#Площа трикутника = 1/2 × b × h

#Напишіть програму, що приймає довжини 2-х катетів у прямокутному трикутнику та друкує його площину. 

try:
    a = float(input("Введіть довжину першого катета: a= "))
    b = float(input("Введіть довжину другого катета: b= "))

    if a > 0 and b > 0:
        area = (a * b) /2
        print("Площа трикутника за допомогою катетів:", area)
    else:
        print("Довжина катетів повинна бути додатнім числом.")
except ValueError:
    print("Введіть числове значення для довжини катетів.")
