#Якщо відомі три сторони трикутника, але невідома його висота, його площа обчислюється за формулою Герона. 
#Припустімо, задано трикутник зі сторонами a, b і c, тоді його площа обчислюється за допомогою таких кроків
#Крок 1: Позначте всі розміри даного трикутника.
#Крок 2. Обчисліть напівпериметр (s) за формулою s = (a+b+c) / 2
#Крок 3: Використовуйте формулу для визначення площі Площа;
#A = √[s(s-a)(s-b)(s-c)]
#Де, a, b і c — сторони трикутника

#Дано трикутник зі сторонами 5 см, 5 см і 6 см. Знайдіть площу і периметр трикутника.

import math


a = 5
b = 5
c = 6

s = (a+b+c) / 2 #Напівпериметр

area = math.sqrt(s * (s - a) * (s - b) * (s - c)) #Площа

perim = a+b+c

print("Площа трикутника:", area, "см^2")
print("Периметр трикутника:", perim, "см")